test/load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 120
      arrivalRate: 20
scenarios:
  - flow:
      - get:
          url: '/products?productCode={{ productCode }}&location={{ location }}'
          headers:
            Content-Type: 'application/json'
variables:
  productCode: ['1000', '2000', '3000', '4000', '4000','5000','7000','8000','9000']
  location: ['Brunei''Cambodia','Indonesia','Laos','Malaysia','Myanmar','Philippines','Singapore','Thailand','Vietnam']