test/load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    # Ramp-up phase
    - duration: 60
      arrivalRate: 0
      rampTo: 300
    # Steady-state phase
    - duration: 120
      arrivalRate: 300
    # Slow-down phase
    - duration: 60
      arrivalRate: 300
      rampTo: 0
scenarios:
  - flow:
      - get:
          url: '/product?productCode={{ productCode }}&location={{ location }}'
          headers:
            Content-Type: 'application/json'
variables:
  productCode: ['1000', '2000', '3000', '4000', '4000', '5000', '7000', '8000', '9000']
  location: ['Brunei', 'Cambodia', 'Indonesia', 'Laos', 'Malaysia', 'Myanmar', 'Philippines', 'Singapore', 'Thailand', 'Vietnam']